### Задание 1

In [3]:
import pandas as pd

In [4]:
authors = pd.DataFrame({
    'author_id':[1,2,3],
    'author_name':['Тургеньев','Чехов','Островский']
})
price = pd.DataFrame({
    'author_id':[1,1,1,2,2,3,3],
    'book_title':['Отцы и дети','Рудин','Дворянское гнездо','Толстый и тонкий','Дама с собачкой','Гроза','Таланты и поклонники'],
    'price':[450,300,350,500,450,370,290]
})

### Задание 2

In [5]:
authors_price = pd.merge(authors, price, on='author_id')
authors_price

   author_id author_name            book_title  price
0          1   Тургеньев           Отцы и дети    450
1          1   Тургеньев                 Рудин    300
2          1   Тургеньев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [6]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1   Тургеньев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1   Тургеньев  Дворянское гнездо    350

### Задание 4

In [38]:
stat = authors_price.groupby('author_name')
min_price = stat.agg({'price':'min'})
max_price = stat.agg({'price':'max'})
mean_price = stat.agg({'price':'mean'})
stat_authors = pd.concat([min_price,max_price,mean_price], axis=1)
stat_authors.columns = ['min_price','max_price','mean_price']
stat_authors

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургеньев          300        450  366.666667
Чехов              450        500  475.000000